In [1]:
import pandas as pd

df = pd.read_csv("Titanic-Dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
df["Age"]=df["Age"].fillna(df["Age"].mean())

In [7]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [21]:
df["Cabin"]=df["Cabin"].fillna(df["Cabin"].mode()[0])

In [22]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [23]:

df=pd.get_dummies(df,columns=['Sex','Embarked'],drop_first=True)

In [30]:
import numpy as np
df['Fare'] = np.log(df['Fare'] + 1)

In [31]:
print(fare)

0      1.032094
1      1.135771
2      1.037726
3      1.126016
4      1.038699
         ...
886    1.066087
887    1.104703
888    1.094356
889    1.104703
890    1.036330
Name: Fare, Length: 891, dtype: float64

In [36]:
import numpy as np
ab=df['Fare'] = np.sqrt(df['Fare'])

In [37]:
print(ab)

0      1.007929
1      1.032340
2      1.009301
3      1.030116
4      1.009537
         ...
886    1.016127
887    1.025207
888    1.022797
889    1.025207
890    1.008961
Name: Fare, Length: 891, dtype: float64

In [42]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
a = df[['Age', 'Fare']] = scaler.fit_transform(df[['Age', 'Fare']])

In [43]:
print(a)

[[-5.92480600e-01  4.59701422e-02]
 [ 6.38789012e-01  2.31689225e-01]
 [-2.84663197e-01  5.64100945e-02]
 ...
 [-2.23290646e-16  1.59090873e-01]
 [-2.84663197e-01  1.77418907e-01]
 [ 1.77062908e-01  5.38256070e-02]]

In [45]:
from sklearn.preprocessing import MinMaxScaler

mms = MinMaxScaler()
ab = df[['Age', 'Fare']] = mms.fit_transform(df[['Age', 'Fare']])

In [46]:
print(ab)

[[0.27117366 0.96581009]
 [0.4722292  0.9892011 ]
 [0.32143755 0.96712499]
 ...
 [0.36792055 0.98005746]
 [0.32143755 0.98236585]
 [0.39683338 0.96679947]]

In [47]:
df.head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Sex_male,Embarked_Q,Embarked_S
0,1,0,3,"Braund, Mr. Owen Harris",0.271174,1,0,A/5 21171,0.965810,B96 B98,True,False,True
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0.472229,1,0,PC 17599,0.989201,C85,False,False,False
2,3,1,3,"Heikkinen, Miss. Laina",0.321438,0,0,STON/O2. 3101282,0.967125,G6,False,False,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0.434531,1,0,113803,0.987070,C123,False,False,True
4,5,0,3,"Allen, Mr. William Henry",0.434531,0,0,373450,0.967351,B96 B98,True,False,True